<section
    class="records rounded-lg md:bg-zinc-50 md:px-7 md:pt-7 md:pb-7 md:shadow-shifted"
>
    <div class="mb-7 flex flex-wrap gap-x-7 gap-y-7 md:flex-nowrap">
        <h2
            class="mr-auto font-display text-2xl font-bold leading-none -tracking-tighter md:text-3xl"
        >
            Мои записи
        </h2>
        @if($notifications->count() > 0)
            <div
                class="-mt-2 flex w-full items-center rounded bg-success-500 py-4 px-6 text-white sm:max-w-[370px]"
            >
                <svg viewBox="0 0 16 20" class="mr-3.5 w-4 shrink-0 fill-current">
                    <path
                        d="M14 14V9c0-3.07-1.63-5.64-4.5-6.32V2a1.5 1.5 0 1 0-3 0v.68C3.64 3.36 2 5.92 2 9v5l-2 2v1h16v-1l-2-2Zm-2 1H4V9c0-2.48 1.51-4.5 4-4.5s4 2.02 4 4.5v6Zm-4 5a2 2 0 0 0 2-2H6c0 1.1.9 2 2 2Z"
                    ></path></svg
                >Сегодня у вас {{ $notifications->count() }} записи в клинике
            </div>
        @endif
    </div>
    <div class="mb-8 flex flex-wrap items-center gap-x-6 gap-y-5 sm:flex-nowrap">
        <div class="grid grow auto-cols-fr grid-flow-col gap-2 sm:gap-4">
            <a
                wire:click="displayAllAppointments"
                class="@if($appointments_status) active @endif flex min-h-11 grow items-center justify-center rounded bg-white py-2 px-4 text-center transition hover:bg-primary-50 [&amp;.active]:bg-primary-500 [&amp;.active]:text-white cursor-pointer"
            >Все записи</a
            ><a
                wire:click="displayCanceledAppointments"
                class="@if(!$appointments_status) active @endif flex min-h-11 grow items-center justify-center rounded bg-white py-2 px-4 text-center transition hover:bg-primary-50 [&amp;.active]:bg-primary-500 [&amp;.active]:text-white cursor-pointer"
            >Несостоявшиеся записи</a
            >
        </div>
        <details class="dropdown group relative z-[3000] open:drop-shadow ml-auto">
            <summary
                class="flex cursor-pointer items-center whitespace-nowrap rounded-t px-5 py-3 transition-[color] hover:text-primary-600 group-open:bg-white"
            >
                Сортировка по дате<svg
                    viewBox="0 0 13 8"
                    class="relative top-0.5 ml-3 h-2 shrink-0 fill-current group-open:top-0 group-open:rotate-180"
                >
                    <path
                        d="m1.42.06-1.1 1.1L6.5 7.35l6.19-6.19-1.1-1.1L6.5 5.14 1.42.06Z"
                    ></path>
                </svg>
            </summary>
            <div class="absolute top-full min-w-full rounded-b bg-white pb-2">
                <a
                    wire:click="sortAppointments('DESC')"
                    class="block py-1.5 px-5 text-xs transition-[color] hover:text-primary-400 [&.active]:font-extrabold cursor-pointer @if($sort_state !== 'oldest') active @endif"
                >Сначала новые записи</a
                ><a
                    wire:click="sortAppointments('ASC')"
                    class="block py-1.5 px-5 text-xs transition-[color] hover:text-primary-400 [&.active]:font-extrabold cursor-pointer @if($sort_state === 'oldest') active @endif"
                >Сначала старые записи</a
                >
            </div>
        </details>
    </div>
    <div class="grid gap-7">
        @foreach($appointments as $appointment)
            <article class=" @if($appointment->checkToday()) active @endif record relative grid overflow-hidden rounded-lg border border-transparent shadow-shifted sm:grid-cols-2 [&.active]:border-success-500 [&.active]:pt-11 sm:[&.active]:!pt-0"
            >
                <div
                    class="absolute inset-x-0 top-0 hidden h-11 bg-success-500 text-white sm:inset-y-0 sm:left-0 sm:h-auto sm:w-11 [.active_&amp;]:block"
                >
                    @if($appointment->checkToday())
                        <span class="absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 sm:-rotate-90">Сегодня</span>
                    @endif
                </div>
                <div class="grid gap-6 py-5 px-5 sm:pl-16">
                        <span class="flex items-center gap-5"
                        ><i class="flex w-5 items-center justify-center"
                            ><svg viewBox="0 0 21 20" class="h-5 shrink-0 fill-current">
                              <path
                                  fill-rule="evenodd"
                                  clip-rule="evenodd"
                                  d="M7.31.07a3.09 3.09 0 0 0-2.06 1.94l-.11.3V6c0 3.65 0 3.68.08 4 .12.44.3.85.5 1.2l.18.3c-.01.02-.69.44-1.5.95l-1.84 1.17c-.44.3-1.13.98-1.46 1.45-.3.43-.67 1.16-.83 1.66A6.01 6.01 0 0 0 0 18.86v.85l.15.14.15.15h19.4l.15-.15.14-.14v-1a5.39 5.39 0 0 0-.27-2.04 7.5 7.5 0 0 0-.8-1.6 7.32 7.32 0 0 0-1.33-1.36l-1.88-1.2-1.6-1 .1-.2c.31-.48.55-1.1.64-1.66.03-.2.04-1.27.03-3.81l-.01-3.52-.1-.31a3.81 3.81 0 0 0-.26-.57A3.95 3.95 0 0 0 13.45.37c-.14-.08-.4-.2-.57-.25l-.3-.1-2.5-.02c-2.35 0-2.5 0-2.77.07Zm4.85 1.14c.8.1 1.42.72 1.53 1.52.02.16.03 1.08.03 2.04v1.75H6.3V4.77c0-.96.02-1.88.04-2.04a1.75 1.75 0 0 1 1.49-1.52 68.3 68.3 0 0 1 4.34 0Zm-2.4 1.13a.85.85 0 0 0-.2.15c-.1.12-.12.15-.13.45l-.01.33-.33.01c-.32.02-.33.02-.48.16-.14.15-.15.16-.15.42 0 .27.01.28.15.42.15.15.16.15.48.17h.33v.34c.02.32.03.33.17.47.14.14.16.15.42.15s.28 0 .42-.15c.14-.14.15-.15.16-.47l.01-.33.33-.01c.32-.02.33-.02.48-.17.14-.14.14-.15.14-.42 0-.26 0-.27-.14-.42-.15-.14-.16-.14-.48-.16l-.33-.01-.01-.33c-.01-.32-.02-.33-.16-.47-.13-.13-.17-.15-.37-.16-.12 0-.26 0-.3.03Zm3.95 6.23c-.01.66-.04.9-.1 1.14-.15.6-.45 1.1-.89 1.51-.42.4-.83.63-1.4.79-.28.07-.4.08-1.31.08-.9 0-1.03 0-1.31-.08a3.08 3.08 0 0 1-1.4-.79 3.12 3.12 0 0 1-.9-1.5 4.91 4.91 0 0 1-.1-1.15l-.02-.83h7.46l-.03.83Zm-7.46 5.01v.84l-.14.06c-.4.18-.81.63-.95 1.07-.1.34-.1.78 0 1.12.16.5.62.96 1.13 1.12a1.97 1.97 0 0 0 1.1 0c.52-.16.98-.62 1.13-1.12.1-.34.1-.78 0-1.12a2 2 0 0 0-.24-.47 2 2 0 0 0-.72-.6l-.1-.02v-1.64l.17.08a4.32 4.32 0 0 0 2.38.4 4.32 4.32 0 0 0 2.56-.47c.01 0 .02.32.02.73v.74l-.54.01c-.52.02-.54.02-.78.15-.28.15-.43.3-.59.6-.1.2-.1.22-.12 1.02-.01.94.01 1.05.28 1.31.24.25.4.3 1.02.28l.53-.02.15-.14c.14-.15.15-.16.15-.42 0-.27 0-.28-.15-.42-.14-.15-.15-.15-.48-.17h-.34l.02-.45c0-.3.03-.46.06-.5a5.9 5.9 0 0 1 1.38-.05 5.9 5.9 0 0 1 1.37.05c.04.04.06.2.07.5l.01.44-.33.01c-.33.02-.34.02-.49.17-.14.14-.14.15-.14.42 0 .26 0 .27.14.42l.15.14.53.02c.63.01.78-.03 1.03-.28.26-.26.29-.37.27-1.3l-.01-.82-.13-.25a1.3 1.3 0 0 0-.6-.58c-.2-.1-.26-.11-.73-.12l-.52-.02v-1.56l.2.13 1.43.9c.66.41 1.34.85 1.5.98a4.97 4.97 0 0 1 1.9 3.7l.02.4H1.17l.02-.39a4.9 4.9 0 0 1 1.87-3.7c.27-.2 3.1-2 3.16-2.01.02 0 .03.37.03.83Zm.88 2.05c.15.08.26.27.26.48 0 .32-.22.55-.55.55a.53.53 0 0 1-.47-.25c-.13-.22-.08-.58.1-.73.1-.08.34-.16.45-.13l.2.08Z"
                              ></path></svg></i
                            >{{ $appointment->appointment_type }}</span
                        ><span class="flex items-center gap-5"
                    ><i class="flex w-5 items-center justify-center"
                        ><svg viewBox="0 0 20 20" class="h-5 shrink-0 fill-current">
                              <path
                                  fill-rule="evenodd"
                                  clip-rule="evenodd"
                                  d="M3.88.05a.71.71 0 0 0-.22.19c-.07.1-.09.18-.1.54l-.01.42h-1.6c-1.56.02-1.58.02-1.7.1a.68.68 0 0 0-.19.23c-.05.12-.06.81-.06 7.9 0 7.08 0 7.77.06 7.9a.8.8 0 0 0 .19.22l.12.08 4.99.01 4.99.02.14.2a5.46 5.46 0 0 0 3.54 2.1 5.37 5.37 0 0 0 3.12-.55c.54-.3.84-.52 1.29-.97a5.3 5.3 0 0 0 .5-6.89l-.11-.14V6.54c0-4.42 0-4.89-.07-5.01a.68.68 0 0 0-.18-.22c-.12-.09-.14-.09-1.71-.1l-1.6-.01V.82c0-.42-.05-.59-.25-.72-.09-.07-.17-.1-.33-.1s-.25.03-.34.1c-.2.13-.25.3-.25.73v.37h-2.34V.83c0-.43-.06-.6-.25-.73a.51.51 0 0 0-.34-.1.51.51 0 0 0-.34.1c-.19.13-.24.3-.24.73v.37H8.24V.83C8.24.4 8.2.23 8 .1 7.9.03 7.82 0 7.66 0s-.25.03-.34.1c-.2.13-.25.3-.25.73v.37H4.73V.83c0-.43-.06-.6-.25-.73a.67.67 0 0 0-.6-.05Zm-.33 2.68c0 .4.06.57.25.7.1.07.18.1.34.1.16 0 .25-.03.34-.1.19-.13.25-.3.25-.7v-.36h2.34v.36c0 .4.06.57.25.7.09.07.18.1.34.1.16 0 .24-.03.33-.1.2-.13.25-.3.25-.7v-.36h2.36v.36c0 .4.05.57.24.7.1.07.18.1.34.1.16 0 .25-.03.34-.1.19-.13.25-.3.25-.7v-.36h2.34v.36c0 .4.06.57.25.7.1.07.18.1.34.1.16 0 .24-.03.33-.1.2-.13.25-.3.25-.7v-.36h2.38v2.35H1.17V2.37h2.38v.36Zm14.1 5.37v2.2a5.86 5.86 0 0 0-1.82-.75 4.64 4.64 0 0 0-1.1-.08c-.5 0-.77.01-1 .07a5.3 5.3 0 0 0-3.17 1.96l-.24.3h-.78c-.67-.01-.8 0-.93.05a.7.7 0 0 0-.22.2c-.07.08-.09.17-.09.33s.02.24.09.34c.15.2.29.24.84.24.37 0 .5.02.5.05l-.08.3c-.04.14-.1.38-.12.54l-.05.29h-.37c-.42 0-.58.05-.72.25-.07.09-.09.17-.09.33s.02.25.09.34c.14.2.3.25.72.25h.37l.05.29a4.96 4.96 0 0 0 .2.83c0 .04-.88.05-4.28.05H1.17V5.9h16.49v2.2ZM3.89 7.17a.69.69 0 0 0-.22.18.57.57 0 0 0-.09.34c0 .16.03.24.1.34.15.22.27.24 1.06.24s.9-.02 1.06-.24c.07-.1.09-.18.09-.34 0-.16-.02-.25-.09-.34-.16-.22-.27-.25-1.07-.25-.58 0-.74.02-.84.07Zm4.72 0a.69.69 0 0 0-.21.18c-.07.1-.09.18-.09.34 0 .16.02.24.09.34.16.22.27.24 1.06.24.8 0 .91-.02 1.07-.24.06-.1.09-.18.09-.34 0-.16-.03-.25-.1-.34-.15-.22-.26-.25-1.06-.25-.58 0-.74.02-.85.07Zm4.69 0a.7.7 0 0 0-.22.18.57.57 0 0 0-.08.34c0 .16.02.24.09.34.15.22.27.24 1.06.24.8 0 .9-.02 1.07-.24.06-.1.08-.18.08-.34 0-.16-.02-.25-.08-.34-.16-.22-.28-.25-1.08-.25-.58 0-.74.02-.84.07ZM3.88 9.5a.69.69 0 0 0-.22.19c-.06.09-.09.17-.09.33s.03.25.1.34c.15.22.27.25 1.06.25s.9-.03 1.06-.25c.07-.09.09-.18.09-.34 0-.16-.02-.24-.09-.33-.16-.23-.27-.25-1.07-.25-.58 0-.74.01-.84.06Zm4.72 0a.69.69 0 0 0-.21.19c-.07.09-.09.17-.09.33s.02.25.09.34c.16.22.27.25 1.06.25.8 0 .91-.03 1.07-.25a.55.55 0 0 0 .09-.34c0-.16-.03-.24-.1-.33-.15-.23-.26-.25-1.06-.25-.58 0-.74.01-.85.06Zm6.6 1.15a4.01 4.01 0 0 1 2.41 1.17 3.97 3.97 0 0 1 1.18 2.49 4 4 0 0 1-1.18 3.3 3.97 3.97 0 0 1-2.48 1.17 4 4 0 0 1-3.3-1.18 3.97 3.97 0 0 1-1.17-2.48 4.01 4.01 0 0 1 .7-2.72c.22-.35.7-.83 1.06-1.06a4.28 4.28 0 0 1 2.78-.69Zm-11.32 1.2a.7.7 0 0 0-.22.18.57.57 0 0 0-.09.34c0 .16.03.24.1.34.15.22.27.24 1.06.24s.9-.02 1.06-.24c.07-.1.09-.18.09-.34 0-.16-.02-.25-.09-.34-.16-.22-.27-.25-1.07-.25-.58 0-.74.02-.84.07Zm10.58 0a.71.71 0 0 0-.21.18c-.09.12-.09.14-.09 1.51s0 1.39.09 1.51c.17.24.21.25 1.65.25 1.43 0 1.48 0 1.65-.25.06-.1.09-.18.09-.34a.52.52 0 0 0-.09-.33c-.17-.24-.25-.25-1.3-.25h-.94v-.95c0-1.04-.01-1.13-.24-1.29a.67.67 0 0 0-.6-.05ZM3.88 14.2a.7.7 0 0 0-.22.19c-.06.09-.09.17-.09.33s.03.25.1.34c.15.22.27.25 1.06.25s.9-.03 1.06-.25c.07-.1.09-.18.09-.34 0-.16-.02-.24-.09-.33-.16-.23-.27-.25-1.07-.25-.58 0-.74.01-.84.06Z"
                              ></path></svg></i
                        >{{ $appointment->date_normal }}, в {{ $appointment->time }} </span
                    ><span class="flex items-center gap-5"
                    ><i class="flex w-5 items-center justify-center"
                        ><svg viewBox="0 0 16 20" class="h-5 shrink-0 fill-current">
                              <path
                                  fill-rule="evenodd"
                                  clip-rule="evenodd"
                                  d="M6.86.06a9.3 9.3 0 0 0-1.52.37 8.2 8.2 0 0 0-5.1 5.64A7.08 7.08 0 0 0 0 8.04c0 .9.06 1.42.29 2.3.19.74.43 1.39.82 2.18.64 1.31 1.46 2.5 2.64 3.85.5.56 1.51 1.58 2.07 2.07l.43.37-.63.02c-.55.02-.64.03-.74.1a.67.67 0 0 0-.25.48c0 .19.12.4.28.5l.13.09h5.92l.13-.09c.16-.1.28-.31.28-.5a.65.65 0 0 0-.25-.48c-.1-.07-.19-.09-.74-.1l-.63-.02.43-.37c.23-.2.7-.66 1.05-1a18.36 18.36 0 0 0 3.66-4.92c.39-.8.63-1.45.82-2.19.23-.89.3-1.4.29-2.29a8.21 8.21 0 0 0-2.99-6.3 8.84 8.84 0 0 0-2.3-1.3A9.23 9.23 0 0 0 9.1.07c-.55-.08-1.72-.08-2.25 0Zm2.02 1.19c.44.05 1.12.23 1.52.38a7.21 7.21 0 0 1 2.97 2.22 7.19 7.19 0 0 1 1.33 3.01c.07.36.08.62.08 1.2 0 .53-.01.86-.06 1.13a9.84 9.84 0 0 1-.87 2.67c-.34.71-.62 1.19-1.08 1.88A21.48 21.48 0 0 1 8 18.64c-.02 0-.2-.15-.42-.31A24.32 24.32 0 0 1 3.8 14.5c-.38-.5-1.04-1.48-1.32-2-.33-.6-.6-1.23-.82-1.86a7.03 7.03 0 0 1 2.44-8.2 6.64 6.64 0 0 1 4.8-1.2ZM7.25 2.89c-.3.04-.81.18-1.12.3a6 6 0 0 0-1.22.66c-.38.27-.91.8-1.2 1.2a5.48 5.48 0 0 0-.9 2.17 5.37 5.37 0 0 0 .67 3.54 5.3 5.3 0 0 0 3.28 2.43c.32.08.53.1 1.05.12a5.28 5.28 0 0 0 5.38-4.37c.07-.47.07-1.24 0-1.72a5.56 5.56 0 0 0-.86-2.1A5.43 5.43 0 0 0 7.25 2.9ZM9 4.17c.43.11.88.32 1.25.57a3.95 3.95 0 0 1 1.65 4.42c-.12.45-.38.98-.64 1.33a4.4 4.4 0 0 1-.99.94 4.8 4.8 0 0 1-1.24.57c-.3.08-.43.09-1.02.09-.6 0-.73-.01-1.02-.1A4.11 4.11 0 0 1 4.1 9.17c-.08-.29-.1-.47-.12-.92a3.96 3.96 0 0 1 1.08-2.9 3.92 3.92 0 0 1 3.06-1.27c.4.02.65.04.87.1ZM7.75 6.4a.85.85 0 0 0-.2.16c-.11.12-.12.14-.13.53l-.01.4h-.36c-.28 0-.4.02-.5.08a.73.73 0 0 0-.31.51c0 .17.16.44.31.53.1.06.23.08.5.1h.36v.36c0 .26.02.38.07.47.22.37.82.37 1.04 0 .05-.1.07-.2.07-.47v-.35l.36-.02c.27-.01.4-.03.5-.1a.77.77 0 0 0 .31-.52.73.73 0 0 0-.31-.51c-.1-.06-.22-.07-.5-.07H8.6v-.41l-.02-.41-.15-.15c-.13-.13-.17-.14-.37-.15a.83.83 0 0 0-.3.02Z"
                              ></path></svg></i
                        >{{ $appointment->clinic->address_city }}, {{ $appointment->clinic->address_street }}, д.{{ $appointment->clinic->address_house }}</span
                    >
                </div>
                <div
                    class="border-t border-primary-500/10 py-5 px-5 sm:border-l sm:border-t-0"
                >
                    <dl class="grid grid-cols-[fit-content(46%)_minmax(0,1fr)] gap-y-6 gap-x-5">
                        <dt class="opacity-50">Лечащий врач:</dt>
                        <dd>{{ $appointment->doctor->fio }}</dd>
                        <dt class="opacity-50">Для приема:</dt>
                        <dd>Паспорт, СНИЛС</dd>
                        <dt class="opacity-50">Телефон:</dt>
                        <dd><a href="tel:+7(3012)37-99-20">+{{ $appointment->doctor->phone }}</a></dd>
                    </dl>
                </div>
            </article>
        @endforeach
    </div>
    {{ $appointments->appends(['sort' => $sort_state])->links('vendor.pagination.custom-pagination', ['route' => route('profile.records')]) }}
</section>
